Relation/PhilScience.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>PhilScience</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-08-31 13:38:50 EDT"/>
<meta name="author" content="Greg"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">PhilScience</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Intensional Philosophy of Science </a>
<ul>
<li><a href="#sec-1.1">1.1 Problems in the Philosophy of Science </a></li>
<li><a href="#sec-1.2">1.2 Observation </a></li>
<li><a href="#sec-1.3">1.3 The Leibniz-Russell Theory </a></li>
<li><a href="#sec-1.4">1.4 Applications of the Leibniz-Russell Theory </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Intensional Philosophy of Science </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Problems in the Philosophy of Science </h3>
<div class="outline-text-3" id="text-1.1">

</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Observation </h3>
<div class="outline-text-3" id="text-1.2">

<p>The <b>EMPIRICAL</b> is anything known through the senses, anything observable.
</p>
<p>
The <b>THEORETICAL</b> is the non-empirical, anything not known through the
senses, but is known by means of the mind, and for which there are good
grounds for belief.
</p>
<p>
<b>EMPIRICAL REALITY</b> is all that we perceive around us that is
potentially universally public.
</p>
<p>
<b>NOUMENAL REALITY</b> is all that exists independently of being observed.
It is what theorists try to describe with theories, or what is usually
described as the underlying causes of empirical reality.
</p>
<p>
<b>COMMON SENSE REALISM</b> is the belief that the empirically real 
is noumenally real.
</p>
<p>
<b>EMPIRICAL PERCEPTION</b> is perception as we know it in everyday experience.
</p>
<p>
<b>THEORETICAL PERCEPTION</b> is the scientific explanation of empirical
perception; it describes <b>NOUMENAL PERCEPTION</b>.
</p>
<p>
The <b>GENERAL PROBLEM OF PERCEPTION</b> is the problem of deciding
whether all that we empirically perceive around us is
reality or images of reality.
</p>
<p>
The <b>IDENTITY ERROR</b> is the contravention of the logical principle
that <b>QUALITATIVE DIFFERENCE ENTAILS QUANTITATIVE DIFFERENCE</b>.
</p>
<p>
The <b>EMPIRICAL WORLD</b> of any one person, at any one time, is
all that they empirically perceive at that time.
</p>
<p>
The <b>NOUMENAL WORLD</b> is all that is noumenally real.
</p></div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> The Leibniz-Russell Theory </h3>
<div class="outline-text-3" id="text-1.3">

<p>The observations of two people are <b>PUBLIC BY IDENTITY</b> if
they both observe one and the same, or identical, thing.
</p>
<p>
The observations of two people are <b>PUBLIC BY SIMILARITY</b> if
they both observe numerically distinct things which have a
fair degree of similarity between them.
</p>
<p>
The observations of two people are <b>PRIVATE BY PLURALITY</b> if
they are not public by identity&ndash;if the observations are two,
not one.
</p>
<p>
The observations of two people are <b>PRIVATE BY DISSIMILARITY</b> if
they have some degree of dissimilarity.
</p></div>

</div>

<div id="outline-container-1.4" class="outline-3">
<h3 id="sec-1.4"><span class="section-number-3">1.4</span> Applications of the Leibniz-Russell Theory </h3>
<div class="outline-text-3" id="text-1.4">

<p><b>NOUMENAL CAUSATION</b> is relations of necessity in the noumenal
world. The antecedents of such relations are <b>NOUMENAL CAUSES</b>
and the consequences are <b>NOUMENAL EFFECTS</b>.
</p>
<p>
<b>EMPIRICAL CAUSATION</b> is exclusively extensional functions
among empirical data, characterised by universality.
The arguments of these are <b>EMPIRICAL CAUSES</b> and their
values are <b>EMPIRICAL EFFECTS</b>.
</p>
<p>
<b>INTENSIONAL SCIENCE</b> is science whose theory is applied 
intensional mathematics.
</p>
<p>
<b>EXCLUSIVELY NOMINAL SCIENCE</b> is all false claims to
empirical data, scientific laws, or theories.
</p>
<p>
<b>EXCLUSIVELY EXTENSIONAL SCIENCE</b> is the science of
empirical extensional sets; it is neither intensional
nor exclusively nominal.
</p>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Greg
<a href="mailto:greg@greg-Satellite-C855D">&lt;greg@greg-Satellite-C855D&gt;</a>
</p>
<p class="date"> Date: 2013-08-31 13:38:50 EDT</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
